STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_ca35.h
/* Bit fields for RCC_GICV2MCFGR register */
#define RCC_GICV2MCFGR_GICV2MEN_Pos                  (1U)
#define RCC_GICV2MCFGR_GICV2MEN_Msk                  (0x1UL << RCC_GICV2MCFGR_GICV2MEN_Pos)                 /*!< 0x00000002 */
#define RCC_GICV2MCFGR_GICV2MEN                      RCC_GICV2MCFGR_GICV2MEN_Msk                           /*!< GICV2M clock enable */
#define RCC_GICV2MCFGR_GICV2MLPEN_Pos                (2U)
#define RCC_GICV2MCFGR_GICV2MLPEN_Msk                (0x1UL << RCC_GICV2MCFGR_GICV2MLPEN_Pos)               /*!< 0x00000004 */
#define RCC_GICV2MCFGR_GICV2MLPEN                    RCC_GICV2MCFGR_GICV2MLPEN_Msk                         /*!< GICV2M clock enable during CSleep  */

/* Bit fields for RCC_I3C1CFGR register */
#define RCC_I3C1CFGR_I3C1RST_Pos                     (0U)
#define RCC_I3C1CFGR_I3C1RST_Msk                     (0x1UL << RCC_I3C1CFGR_I3C1RST_Pos)                    /*!< 0x00000001 */
#define RCC_I3C1CFGR_I3C1RST                         RCC_I3C1CFGR_I3C1RST_Msk                              /*!< I3C1 reset */
#define RCC_I3C1CFGR_I3C1EN_Pos                      (1U)
#define RCC_I3C1CFGR_I3C1EN_Msk                      (0x1UL << RCC_I3C1CFGR_I3C1EN_Pos)                     /*!< 0x00000002 */
#define RCC_I3C1CFGR_I3C1EN                          RCC_I3C1CFGR_I3C1EN_Msk                               /*!< I3C1 clock enable */
#define RCC_I3C1CFGR_I3C1LPEN_Pos                    (2U)
#define RCC_I3C1CFGR_I3C1LPEN_Msk                    (0x1UL << RCC_I3C1CFGR_I3C1LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I3C1CFGR_I3C1LPEN                        RCC_I3C1CFGR_I3C1LPEN_Msk                             /*!< I3C1 clock enable during CSleep  */

/* Bit fields for RCC_I3C2CFGR register */
#define RCC_I3C2CFGR_I3C2RST_Pos                     (0U)
#define RCC_I3C2CFGR_I3C2RST_Msk                     (0x1UL << RCC_I3C2CFGR_I3C2RST_Pos)                    /*!< 0x00000001 */
#define RCC_I3C2CFGR_I3C2RST                         RCC_I3C2CFGR_I3C2RST_Msk                              /*!< I3C2 reset */
#define RCC_I3C2CFGR_I3C2EN_Pos                      (1U)
#define RCC_I3C2CFGR_I3C2EN_Msk                      (0x1UL << RCC_I3C2CFGR_I3C2EN_Pos)                     /*!< 0x00000002 */
#define RCC_I3C2CFGR_I3C2EN                          RCC_I3C2CFGR_I3C2EN_Msk                               /*!< I3C2 clock enable */
#define RCC_I3C2CFGR_I3C2LPEN_Pos                    (2U)
#define RCC_I3C2CFGR_I3C2LPEN_Msk                    (0x1UL << RCC_I3C2CFGR_I3C2LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I3C2CFGR_I3C2LPEN                        RCC_I3C2CFGR_I3C2LPEN_Msk                             /*!< I3C2 clock enable during CSleep  */

/* Bit fields for RCC_I3C3CFGR register */
#define RCC_I3C3CFGR_I3C3RST_Pos                     (0U)
#define RCC_I3C3CFGR_I3C3RST_Msk                     (0x1UL << RCC_I3C3CFGR_I3C3RST_Pos)                    /*!< 0x00000001 */
#define RCC_I3C3CFGR_I3C3RST                         RCC_I3C3CFGR_I3C3RST_Msk                              /*!< I3C3 reset */
#define RCC_I3C3CFGR_I3C3EN_Pos                      (1U)
#define RCC_I3C3CFGR_I3C3EN_Msk                      (0x1UL << RCC_I3C3CFGR_I3C3EN_Pos)                     /*!< 0x00000002 */
#define RCC_I3C3CFGR_I3C3EN                          RCC_I3C3CFGR_I3C3EN_Msk                               /*!< I3C3 clock enable */
#define RCC_I3C3CFGR_I3C3LPEN_Pos                    (2U)
#define RCC_I3C3CFGR_I3C3LPEN_Msk                    (0x1UL << RCC_I3C3CFGR_I3C3LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I3C3CFGR_I3C3LPEN                        RCC_I3C3CFGR_I3C3LPEN_Msk                             /*!< I3C3 clock enable during CSleep  */

/* Bit fields for RCC_I3C4CFGR register */
#define RCC_I3C4CFGR_I3C4RST_Pos                     (0U)
#define RCC_I3C4CFGR_I3C4RST_Msk                     (0x1UL << RCC_I3C4CFGR_I3C4RST_Pos)                    /*!< 0x00000001 */
#define RCC_I3C4CFGR_I3C4RST                         RCC_I3C4CFGR_I3C4RST_Msk                              /*!< I3C4 reset */
#define RCC_I3C4CFGR_I3C4EN_Pos                      (1U)
#define RCC_I3C4CFGR_I3C4EN_Msk                      (0x1UL << RCC_I3C4CFGR_I3C4EN_Pos)                     /*!< 0x00000002 */
#define RCC_I3C4CFGR_I3C4EN                          RCC_I3C4CFGR_I3C4EN_Msk                               /*!< I3C4 clock enable */
#define RCC_I3C4CFGR_I3C4LPEN_Pos                    (2U)
#define RCC_I3C4CFGR_I3C4LPEN_Msk                    (0x1UL << RCC_I3C4CFGR_I3C4LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_I3C4CFGR_I3C4LPEN                        RCC_I3C4CFGR_I3C4LPEN_Msk                             /*!< I3C4 clock enable during CSleep  */
#define RCC_I3C4CFGR_I3C4AMEN_Pos                    (3U)
#define RCC_I3C4CFGR_I3C4AMEN_Msk                    (0x1UL << RCC_I3C4CFGR_I3C4AMEN_Pos)                   /*!< 0x00000008 */
#define RCC_I3C4CFGR_I3C4AMEN                        RCC_I3C4CFGR_I3C4AMEN_Msk                             /*!< I3C4 autonomous clock mode enable */

/* Bit fields for RCC_MUXSELCFGR register */
#define RCC_MUXSELCFGR_MUXSEL0_Pos                   (0U)
#define RCC_MUXSELCFGR_MUXSEL0_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL0_Pos)                  /*!< 0x00000003 */
#define RCC_MUXSELCFGR_MUXSEL0                       RCC_MUXSELCFGR_MUXSEL0_Msk                            /*!< PLL4 reference clock selection */
#define RCC_MUXSELCFGR_MUXSEL1_Pos                   (4U)
#define RCC_MUXSELCFGR_MUXSEL1_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL1_Pos)                  /*!< 0x00000030 */
#define RCC_MUXSELCFGR_MUXSEL1                       RCC_MUXSELCFGR_MUXSEL1_Msk                            /*!< PLL5 reference clock selection */
#define RCC_MUXSELCFGR_MUXSEL2_Pos                   (8U)
#define RCC_MUXSELCFGR_MUXSEL2_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL2_Pos)                  /*!< 0x00000300 */
#define RCC_MUXSELCFGR_MUXSEL2                       RCC_MUXSELCFGR_MUXSEL2_Msk                            /*!< PLL6 reference clock selection */
#define RCC_MUXSELCFGR_MUXSEL3_Pos                   (12U)
#define RCC_MUXSELCFGR_MUXSEL3_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL3_Pos)                  /*!< 0x00003000 */
#define RCC_MUXSELCFGR_MUXSEL3                       RCC_MUXSELCFGR_MUXSEL3_Msk                            /*!< PLL7 reference clock selection */
#define RCC_MUXSELCFGR_MUXSEL4_Pos                   (16U)
#define RCC_MUXSELCFGR_MUXSEL4_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL4_Pos)                  /*!< 0x00030000 */
#define RCC_MUXSELCFGR_MUXSEL4                       RCC_MUXSELCFGR_MUXSEL4_Msk                            /*!< PLL8 reference clock selection */
#define RCC_MUXSELCFGR_MUXSEL5_Pos                   (20U)
#define RCC_MUXSELCFGR_MUXSEL5_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL5_Pos)                  /*!< 0x00300000 */
#define RCC_MUXSELCFGR_MUXSEL5                       RCC_MUXSELCFGR_MUXSEL5_Msk                            /*!< PLL1 reference clock selection (ck_pll1_ref) */
#define RCC_MUXSELCFGR_MUXSEL6_Pos                   (24U)
#define RCC_MUXSELCFGR_MUXSEL6_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL6_Pos)                  /*!< 0x03000000 */
#define RCC_MUXSELCFGR_MUXSEL6                       RCC_MUXSELCFGR_MUXSEL6_Msk                            /*!< PLL2 reference clock selection (ck_pll2_ref) */
#define RCC_MUXSELCFGR_MUXSEL7_Pos                   (28U)
#define RCC_MUXSELCFGR_MUXSEL7_Msk                   (0x3UL << RCC_MUXSELCFGR_MUXSEL7_Pos)                  /*!< 0x30000000 */
#define RCC_MUXSELCFGR_MUXSEL7                       RCC_MUXSELCFGR_MUXSEL7_Msk                            /*!< PLL3 reference clock selection (ck_pll3_ref) */

/* Bit fields for RCC_XBARxCFGR registers : x in [0;63] */
#define RCC_XBARxCFGR_XBARxSEL_Pos                   (0U)
#define RCC_XBARxCFGR_XBARxSEL_Msk                   (0xFUL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_0                     (0x0UL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_1                     (0x1UL << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_2                     (0x2UL << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_3                     (0x3UL << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_4                     (0x4UL << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_5                     (0x5UL << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_6                     (0x6UL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_7                     (0x7UL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_8                     (0x8UL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_9                     (0x9UL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_A                     (0xAUL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_B                     (0xBUL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_C                     (0xCUL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_D                     (0xDUL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxSEL_E                     (0xEUL  << RCC_XBARxCFGR_XBARxSEL_Pos)
#define RCC_XBARxCFGR_XBARxEN_Pos                    (6U)
#define RCC_XBARxCFGR_XBARxEN_Msk                    (0x1UL << RCC_XBARxCFGR_XBARxEN_Pos)
#define RCC_XBARxCFGR_XBARxEN                        RCC_XBARxCFGR_XBARxEN_Msk
#define RCC_XBARxCFGR_XBARxSTS_Pos                   (7U)
#define RCC_XBARxCFGR_XBARxSTS_Msk                   (0x1UL << RCC_XBARxCFGR_XBARxSTS_Pos)
#define RCC_XBARxCFGR_XBARxSTS                       RCC_XBARxCFGR_XBARxSTS_Msk

/* Bit fields for RCC_PREDIVxCFGR registers : x in [0;63] */
#define RCC_PREDIVxCFGR_PREDIVx_Pos                  (0U)
#define RCC_PREDIVxCFGR_PREDIVx_Msk                  (0x3FFUL  << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define RCC_PREDIVxCFGR_PREDIVx_DIV1                 (0x000UL  << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define RCC_PREDIVxCFGR_PREDIVx_DIV2                 (0x001UL  << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define RCC_PREDIVxCFGR_PREDIVx_DIV4                 (0x003UL  << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define RCC_PREDIVxCFGR_PREDIVx_DIV1024              (0x3FFUL  << RCC_PREDIVxCFGR_PREDIVx_Pos)

/* Bit fields for RCC_PREDIVSR1 register */
#define RCC_PREDIVSR1_PREDIVSTS_Pos                  (0U)
#define RCC_PREDIVSR1_PREDIVSTS_Msk                  (0xFFFFFFFFUL << RCC_PREDIVSR1_PREDIVSTS_Pos)
#define RCC_PREDIVSR1_PREDIVSTS                      RCC_PREDIVSR1_PREDIVSTS_Msk

/* Bit fields for RCC_PREDIVSR2 register */
#define RCC_PREDIVSR2_PREDIVSTS_Pos                  (0U)
#define RCC_PREDIVSR2_PREDIVSTS_Msk                  (0xFFFFFFFFUL << RCC_PREDIVSR2_PREDIVSTS_Pos)
#define RCC_PREDIVSR2_PREDIVSTS                      RCC_PREDIVSR2_PREDIVSTS_Msk

/* Bit fields for RCC_FINDIVxCFGR registers : x in [0;63] */
#define RCC_FINDIVxCFGR_FINDIVx_Pos                  (0U)
#define RCC_FINDIVxCFGR_FINDIVx_Msk                  (0x3fUL  << RCC_FINDIVxCFGR_FINDIVx_Pos)
#define RCC_FINDIVxCFGR_FINDIVxEN_Pos                (6U)
#define RCC_FINDIVxCFGR_FINDIVxEN_Msk                (0x1UL << RCC_FINDIVxCFGR_FINDIVxEN_Pos)
#define RCC_FINDIVxCFGR_FINDIVxEN                    RCC_FINDIVxCFGR_FINDIVxEN_Msk

/* Bit fields for RCC_FINDIVSR1 register */
#define RCC_FINDIVSR1_FINDIVSTS_Pos                  (0U)
#define RCC_FINDIVSR1_FINDIVSTS_Msk                  (0xFFFFFFFFUL << RCC_FINDIVSR1_FINDIVSTS_Pos)
#define RCC_FINDIVSR1_FINDIVSTS                      RCC_FINDIVSR1_FINDIVSTS_Msk

